Revit 2026 API

# WoodWoodThickness Property

---

The property labeled "Grain Thickness" from the "Wood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodThickness { get; }
```
```vb
Public Shared ReadOnly Property WoodThickness As String
	Get
```
```cpp
public:
static property String^ WoodThickness {
	String^ get ();
}
```
```fsharp
static member WoodThickness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 100".

#### Reference

Wood Class

Autodesk.Revit.DB.Visual Namespace